var articles = [ 
  {
    id: 28,
    date: "11/2/2026",
    title:
      "Οι Κόντρες των Αμαξών: Όταν τα Άλογα Ήταν… τα Turbo του Παρελθόντος",
    pic: "amaxa",
    category: "ΤΕΧΝΟΛΟΓΙΑ",
    author: "Father Diablo",
    link: "amaxa",
    text: " <p>          Σύμφωνα με απόλυτα έγκυρες πηγές που σίγουρα δεν είναι ο ξάδερφος          κάποιου από το 1873, υπήρχε εποχή που οι δρόμοι δεν αντηχούσαν απόεξατμίσεις αλλά από οπλές που έσκαγαν στο χώμα σαν τύμπανα πολέμου.Μόλις έπεφτε ο ήλιος, οι αμαξάδες μαζεύονταν στα σκοτεινά στενά πίσωαπό στάβλους και ταβέρνες και ψιθύριζαν προκλήσεις μεταξύ τους, ενώ ταάλογα φυσούσαν ατμούς λες και είχαν μέσα τους μικρούς ατμοκινητήρες.Κανείς δεν ξέρει ποιος έκανε την πρώτη κόντρα, αλλά θρύλοι λένε ότιξεκίνησε όταν δύο τύποι τσακώθηκαν για το ποιος είχε το πιο γυαλιστερόκαπίστρι και κατέληξαν να τρέχουν μέχρι το επόμενο χωριό με τα άλογανα καλπάζουν τόσο γρήγορα που άφηναν πίσω μικρές ανεμοθύελλες απόσκόνη, καπέλα και περιστασιακά κάποιον περαστικό που απλά στεκόταν στολάθος σημείο της ιστορίας. </p><><p>Τα άλογα εκείνης της εποχής δεν ήταν απλά ζώα, ήταν ζωντανά αγωνιστικά μηχανήματα με προσωπικότητες μεγαλύτερες από τους ιδιοκτήτες τους. Υπήρχαν άλογα που αρνούνταν να τρέξουν αν δεν άκουγαν συγκεκριμένο σφύριγμα, άλογα που θύμωναν αν έχαναν και κλώτσαγαν άμαξες, και ένα θρυλικό άλογο που λέγεται ότι έσπασε το «φράγμα του ήχου» τρομάζοντας τρεις κόκορες, έναν παπά και πιθανότατα τη λογική της φυσικής. Οι αμαξάδες ορκίζονταν ότι μπορούσαν να καταλάβουν από τον ήχο της οπλής αν το άλογο ήταν σε “race mode” ή σε “πάμε για σανό και χαλάρωση”. </p><p>Το tuning είχε ξεφύγει εντελώς από κάθε  έλεγχο. Κυκλοφορούσαν ιστορίες για άμαξες τόσο ελαφριές που αν φύσαγε  δυνατός αέρας έφευγαν πριν ξεκινήσει η κόντρα. Μερικοί έβαζαν ειδικά  δερμάτινα λουριά «αγωνιστικής τεχνολογίας», άλλοι τάιζαν τα άλογα  μυστικά μείγματα που περιλάμβαναν καρότα, μέλι, βρώμη και κάτι που  κανείς δεν παραδεχόταν ότι ήταν πιθανότατα απλά ζάχαρη. Υπήρχαν ακόμα  και φήμες για παράνομες «δίδυμες άμαξες» όπου δύο άλογα τραβούσαν μία  μικροσκοπική άμαξα που έμοιαζε περισσότερο με καρότσι λαχανικών παρά  με όχημα, αλλά πήγαινε τόσο γρήγορα που οι μάρτυρες έλεγαν ότι έβλεπαν  μόνο μια θολούρα και άκουγαν κάποιον να φωνάζει «ΚΡΑΤΑ ΤΟ ΚΑΠΕΛΟ!». Οι  θεατές δεν ήταν απλοί θεατές, ήταν οπαδοί με φανατισμό επιπέδου  τελικού πρωταθλήματος. Στοιχήματα έπεφταν σε αυγά, ψωμιά, ακόμα και σε  ολόκληρες κότες. Κάποιοι έλεγαν ότι μπορούσαν να προβλέψουν τον νικητή  από το πώς κοιτούσε το άλογο πριν την εκκίνηση. Αν το άλογο κοίταζε  ίσια μπροστά, ήταν έτοιμο για δόξα. Αν κοιτούσε στο πλάι, πιθανότατα        είχε δει χόρτο και η κόντρα είχε τελειώσει πριν καν αρχίσει. Η τοπική        αρχή προσπαθούσε να ελέγξει την κατάσταση αλλά συνήθως κατέληγε να        κυνηγάει σύννεφα σκόνης. Υπάρχουν αναφορές για χωροφύλακες που έγραφαν        πρόστιμα για «επικίνδυνο καλπασμό», «υπερβολική χρήση μαστιγίου» και        μία φορά για «τρομοκράτηση χήνας δημόσιας ιδιοκτησίας». Σε μια διάσημη        καταδίωξη, λέγεται ότι τέσσερις άμαξες έτρεχαν ταυτόχρονα και πέρασαν        από μια αγορά τόσο γρήγορα που οι πάγκοι συνέχισαν να κουνιούνται για        πέντε λεπτά και ένας πωλητής ορκιζόταν ότι πούλησε πατάτες σε κάποιον        που δεν υπήρχε. </p><p>Η μεγαλύτερη κόντρα όλων των εποχών, σύμφωνα με μύθους            που σίγουρα μεγάλωσαν λίγο με τα χρόνια, κράτησε τόσο πολύ που πέρασε            από τρία χωριά, δύο γάμους και ένα πανηγύρι, με τους οδηγούς να            αλλάζουν καπέλα εν κινήσει για καλύτερη αεροδυναμική. Κάποιος            ισχυρίστηκε ότι είδε σπίθες να βγαίνουν από οπλές, κάποιος άλλος ότι            άκουσε μουσική πολέμου χωρίς να υπάρχει ορχήστρα, και ένας γέρος είπε            ότι εκείνη τη μέρα κατάλαβε ότι ο κόσμος είχε πάει πολύ μπροστά και            ταυτόχρονα πολύ λάθος. Όταν εμφανίστηκαν τα αυτοκίνητα, οι παλιοί            κοντράκηδες προσπάθησαν να τα ανταγωνιστούν, αλλά κανείς δεν μπορούσε            να ξεπεράσει το θέαμα ενός αλόγου που καλπάζει με μάτια γεμάτα πάθος            και έναν αμαξά που φωνάζει οδηγίες λες και συντονίζει καταιγίδα. Μέχρι            σήμερα, αν ακούσεις δυνατό χτύπο σε παλιό χωματόδρομο, κάποιοι λένε            ότι είναι απλά ο αέρας, ενώ άλλοι ξέρουν ότι ίσως είναι δύο άμαξες που            ακόμα κοντράρονται σε κάποιο ξεχασμένο κομμάτι του χρόνου, με άλογα            που αρνούνται να δεχτούν ότι η εποχή τους τελείωσε ποτέ.    </p></>",
  },
  {
    id: 27,
    date: "11/2/2026",
    title: "Σελήνη: Νεκρός Δορυφόρος ή Ζωοφόρος Πλανήτης",
    pic: "moon",
    category: "ΦΥΣΙΚΗ",
    author: "ROBERT MUGABE jr",
    link: "moon",
    text: " <p>          Η επικρατούσα άποψη θέλει τη Σελήνη να είναι ένα σώμα χαμηλής μέσης          πυκνότητας, με ασθενές και πλήρως χαρτογραφημένο βαρυτικό πεδίο. Όμως          πόσο βέβαιοι είμαστε ότι οι μετρήσεις που δημοσιεύονται αντανακλούν το          σύνολο των δεδομένων; Και ποιος αποφασίζει ποια δεδομένα θεωρούνται          «θόρυβος» και ποια «επιστημονικό αποτέλεσμα»;        </p>        <><p>                Υπάρχουν ενδείξεις —που συνήθως αποσιωπώνται ως «ανωμαλίες»— ότι η                εσωτερική δομή της Σελήνης είναι πολύ πιο σύνθετη. Μικρές αλλά                συστηματικές αποκλίσεις στις τροχιές διαστημικών σκαφών, ανεξήγητες                μεταβολές στη σεληνιακή μάζα όπως αυτή υπολογίζεται δυναμικά, και                τοπικές βαρυτικές ανωμαλίες (mascons) που ποτέ δεν ερμηνεύτηκαν                πλήρως. Γιατί άραγε η συζήτηση σταματά πάντα εκεί;            </p><p>                    Αν δεχτούμε ότι η Σελήνη διαθέτει ένα αμυδρό βαρυτικό πεδίο,                    εξαρτώμενο από εξωτερικούς παράγοντες, τότε ο ρόλος της ηλιακής                    δραστηριότητας γίνεται κρίσιμος. Είναι γνωστό ότι η ηλιακή ακτινοβολία                    και ο ηλιακός άνεμος επηρεάζουν το διαπλανητικό μέσο. Τι συμβαίνει                    όμως όταν η δραστηριότητα αυτή περιορίζεται;                </p><p>                    Το απλανές διάστημα δεν είναι κενό, αλλά περιέχει, πέρα από                    μετεωρίτες, παγωμένα μόρια νερού και μικροσκοπικά ίχνη σωματίδιων σε                    μετασταθή ισορροπία. Σε συνήθεις συνθήκες και κατά την επικρατούσα                    θεωρία η σελήνη αποτελεί απλά ένα εμπόδιο που παρεμβάλλεται μεταξύ Γης                    και διαστήματος για να σταματά τα μεγαλύτερα και μικρότερα                    αντικείμενα. Μήπως όμως η σελήνη έχει επαρκή μάζα για να έλκει αυτά τα                    σώματα δείχνοντας ότι κάτι κρύβει απ τα τηλεσκόπιά μας;                </p><p>                    Εδώ εμφανίζεται το φαινόμενο που βιαστικά σε κάποιους κύκλους                    βαφτίζεται «ασυνήθιστη χιονόπτωση»(βλέπε εικόνα άρθρου). Χιόνι χωρίς                    την αναμενόμενη ατμοσφαιρική υγρασία, χωρίς την κλασική νεφογένεση που                    διδάσκουν τα εγχειρίδια. Πώς εξηγείται η παρουσία παγωμένων κρυστάλλων                    αν όχι από εξωατμοσφαιρική προέλευση; Και γιατί αυτά τα περιστατικά                    συμπίπτουν συχνά με περιόδους ελάχιστης ηλιακής δραστηριότητας;                </p><p>                    Η επίσημη επιστήμη απαντά με γενικόλογους όρους και στατιστικά                    μοντέλα. Όμως τα μοντέλα προσαρμόζονται στα δεδομένα ή τα δεδομένα στα                    μοντέλα Γιατί αν υπάρχει νερό με οποιαδήποτε μορφή μπορεί να                    υπάρξει/υπάρχει και ζωή. Επίσης το αυξημένο βαρυτικό πεδίο μπορεί να                    υποδηλώνει ότι αυτή η ζωή κατοικεί εντός της σελήνης κι όχι στην                    επιφάνεια όπως μέχρι τώρα θα αναμέναμε. Το πραγματικό ερώτημα λοιπόν                    δεν είναι αν αυτή η υπόθεση είναι «αιρετική». Το ερώτημα είναι: γιατί                    δεν ερευνάται σοβαρά; Και τι φοβόμαστε περισσότερο να ανακαλύψουμε —                    ότι το κλίμα είναι πιο σύνθετο απ’ όσο μας λένε ή ότι η Σελήνη δεν                    είναι απλώς ένας νεκρός δορυφόρος, αλλά ένας ενεργός πλανήτης πιθανώς                    με πόλεις και πολιτισμό στο υπέδαφός της; Ή μήπως αυτή τη πληροφορία                    την ελέγχουν κάποιοι χωρίς να θέλουν να τη μάθουν οι πολλοί;                </p></>",
  },
  {
    id: 26,
    date: "10/2/2026",
    title: "Αλληγορίες και Σπήλαια",
    pic: "cave",
    category: "ΙΣΤΟΡΙΑ",
    author: "ROBERT MUGABE jr",
    link: "cave",
    text: " <p>          Ο Πλάτωνας έχει μείνει στη ιστορία για το έργο του. Ένα από τα πιο          γνωστά χωρία του είναι ο «μύθος» του σπηλαίου στη Πολιτεία. Και αν το          σπήλαιο του Πλάτωνα δεν ήταν ποτέ απλώς μια αλληγορία; Αν δεν ήταν          φιλοσοφικό τέχνασμα για πρωτοετείς φοιτητές, αλλά ένας πραγματικός,          υγρός, ασβεστολιθικός χώρος; Ένας χώρος στυγνών βασανιστηρίων των          αντιπάλων και κατακριτών των φιλοσοφικών ιδεών ενός διαταραγμένου          νάρκισσου.        </p>        <><p>                Ας αναρωτηθούμε: γιατί ο Πλάτωνας ήταν τόσο σίγουρος; Γιατί και πως                μιλούσε με τόση ακρίβεια για δεσμά, για φωτιά, για συγκεκριμένη                κατεύθυνση φωτός; Τυχαίο; Ή μήπως ήταν περιγραφή πραγματικής                εγκατάστασης; Μήπως το σπήλαιο ήταν το πρώτο “κέντρο αναμόρφωσης                συνείδησης” της αρχαιότητας. Και αν το σπήλαιο ήταν πραγματικό, τότε                ποιοι ήταν δεμένοι εκεί μέσα; Μα φυσικά: οι αντίπαλοι του Πλάτωνα. Οι                σοφιστές. Οι ενοχλητικοί. Εκείνοι που έκαναν πολλές ερωτήσεις – τις                λάθος ερωτήσεις.            </p><p>                    Και αφού κάποιος έμπαινε εκεί άρχιζαν τα χειρότερα. Αλυσοδεμένοι στα                    πόδια και στο λαιμό ώστε να ναι σε πλήρη ακινησία και με φωτιά να                    καίει από πίσω τους (ἐν ταύτῃ ἐκ παίδων ὄντας ἐν δεσμοῖς καὶ τὰ σκέλη                    καὶ τοὺς αὐχένας, ὥστε μένειν τε αὐτοὺς εἴς τε τὸ πρόσθεν μόνον ὁρᾶν,                    κύκλῳ δὲ τὰς κεφαλὰς ὑπὸ τοῦ δεσμοῦ ἀδυνάτους περιάγειν, φῶς δὲ αὐτοῖς                    πυρὸς ἄνωθεν καὶ πόρ- ρωθεν καόμενον ὄπισθεν αὐτῶν). Μόνη «διασκέδαση»                    ο αντίλαλος και καμιά σκιά στο τοίχο. Και αφού η μαύρη τύχη τους έφερε                    απέναντι στον δέσμιό τους θα έμεναν εκεί για πάντα (Πῶς γάρ, ἔφη, εἰ                    ἀκινήτους γε τὰς κεφαλὰς ἔχειν ἠναγκασμένοι εἶεν διὰ βίου;).                </p><p>                    Όμως προειδοποιεί και τους μαθητές για το τι μέλλει γενέσθαι αν ποτέ                    πάρουν αυτό το δρόμο της ανυπακοής και την αντιπαράθεσης με το                    «δάσκαλο». Θα προτιμούσαν οι ίδιοι να πάνε οικειοθελώς στο «σπήλαιο»                    (Οὕτως, ἔφη, ἔγωγε οἶμαι, πᾶν μᾶλλον πεπονθέναι ἂν δέξασθαι ἢ ζῆν                    ἐκείνως.).                </p><p>                    Υπάρχει όμως αυτό το σπήλαιο σαν φυσικός χώρος. Το κείμενο λέει ότι το                    φως δημιουργεί είδωλα και σκιές. Άρα βρίσκεται κάπου ανατολικά από την                    αρχαία Αθήνα. Έχει σπήλαιο εκεί; Φυσικά και έχει. Το σπήλαιο της                    Πεντέλης. Εκεί που έδρασε πολύ αργότερα ο λήσταρχος Νταβέλης και έγινε                    μέρος σατανιστικών τελετών. Ίσως είδαν τη τελειότητα της                    απομονωνόμενης σπηλιάς για την εξαφάνιση ατόμων κάτι που οι φιλόλογοι                    βλέπουν σαν «αλληγορία».                </p><p>                    Μα δεν απέδρασε ποτέ κανείς, μπορεί πολύ εύλογα να διερωτάστε. Σίγουρα                    όλο και κάποιος θα έφευγε. Αρχικά θα έβρισκε αντίσταση στους άλλους                    κρατούμενους που θα φοβόντουσαν τα χειρότερα και θα προσπαθούσαν να                    τον λιντσάρουν (καὶ ὅτι οὐκ ἄξιον οὐδὲ πειρᾶσθαι ἄνω ἰέναι; καὶ τὸν                    ἐπιχειροῦντα λύειν τε καὶ ἀνάγειν, εἴ πως ἐν ταῖς χερσὶ δύναιντο                    λαβεῖν καὶ ἀποκτείνειν, ἀποκτεινύναι ἄν;). Απ’ ότι φαίνεται όμως                    τελικά κάποιος γλύτωσε και αποκάλυψε το μυστικό. Και ο δάσκαλος για να                    μη πιεί κώνειο τράπηκε σε φυγή και έφυγε απ’ την Αθήνα.                </p><p>                    Η δύναμη της εξουσίας διαφθείρει ακόμα κι αν είναι πνευματική η                    εξουσία. Και η εξουσία παρουσιάζει ότι θέλει ως αλήθεια υπό όποιο                    πρίσμα βολεύει κατά περίπτωση. Πόσες αλήθειες βαφτίστηκαν αλληγορίες                    για να γίνουν ανώδυνες; Και πόσα σπήλαια υπάρχουν ακόμη — όχι μόνο στο                    μάρμαρο της Πεντέλης, αλλά μέσα στην ίδια την ιστορία, εκεί όπου                    όποιος ρωτάει «λάθος» κινδυνεύει να δεθεί; Μήπως, τελικά, το πιο                    σκοτεινό ερώτημα δεν είναι τι έβλεπαν οι δεσμώτες… αλλά ποιος κρατούσε                    τη φωτιά;                </p></>",
  },
  {
    id: 25,
    date: "10/2/2026",
    title: "Αλχημιστές, Αίμα και ο Θρόνος",
    pic: "lionheart",
    category: "ΙΣΤΟΡΙΑ",
    author: "ΜΑΡΙΑ ΘΗΡΕΣΙΑ",
    link: "lionheart",
    text: " <p>          Ο Ριχάρδος Α΄ της Αγγλίας, γεννημένος το 1157 γιος του Ερρίκου Β΄ και της          Ελεονώρας της Ακουιτανίας, προοριζόταν για μεγαλείο, κι όμως τα πρώτα          χρόνια της ζωής του στιγματίζονται από σωματική αστάθεια. Τα          βιογραφικά αποσπάσματα των χρονικογράφων μιλούν για ένα παιδί ωχρό, με          δύσπνοια, λιποθυμίες και μια «καρδιακή ατονία» που προκαλούσε ανησυχία          στην αυλή. Πώς θα μπορούσε ένας τέτοιος νέος να αντέξει το βάρος της          βασιλείας και του πολέμου; Μήπως η ίδια η φύση είχε κάνει λάθος στον          σχεδιασμό του; Και αν ναι, ποιος θα τολμούσε να την διορθώσει; Η          απάντηση, σύμφωνα με μια ιστορικά παράλληλη αλλά επίμονα          επανεμφανιζόμενη παράδοση, βρίσκεται στους αλχημιστές. Όχι τους          γραφικούς μάγους της λαϊκής φαντασίας, αλλά λόγιους της εποχής,          μαθημένους στη μεταφυσική του Αριστοτέλη, στα αραβικά ιατρικά          συγγράμματα και στην τέχνη της μεταστοιχείωσης. Ο Ριχάρδος όντας ο          ευνοούμενος γιος της μητέρας του Ελεονώρας, που προφανώς και δε θα          αφηνόταν στη τύχη του λίγο πριν έρθει η ώρα να αναλάβει τα βασιλικά          καθήκοντά του, ταξίδεψε ως στη νότια Ιταλία και σε επαφή με την αυλή          της Σικελίας, φέρεται να έπεσε στα χέρια του αρχιαλχημιστή που ανέλαβε          την υπόθεση του νεαρού πρίγκιπα. Εκείνος διατύπωσε τη ριζοσπαστική          ιδέα: η ελλαττωματική του αλλά ανθρώπινη καρδιά, πυρήνας των          προβλημάτων υγείας, μπορούσε να αντικατασταθεί από μια ανώτερη άρτια          και λειτουργική καρδιά. Και ποιο ζώο θα ταίριαζε καλύτερα σε βασιλιά          από το λιοντάρι;        </p>        <><p>                Η «εγχείρηση» παρουσιάζεται στις πηγές ως μυστική και τελετουργική.                Πιο κοντά σε μαγική τελετή παρά σε ιατρική επέμβαση του Ιπποκράτη. Η                καρδιά του μεγαλοπρεπέστερου λευκού λιονταριού της αυλής, καθαρμένη με                αλχημικά διαλύματα, εμποτισμένη με ελιξίρια υδραργύρου και φυτικών                αποσταγμάτων, θεωρήθηκε ικανή να «συντονιστεί» με το ανθρώπινο σώμα.                Όμως οι ίδιοι οι αλχημιστές, λέγεται, προειδοποίησαν τον Ριχάρδο για                τον μεγάλο κίνδυνο: το μόσχευμα μπορούσε ανά πάσα στιγμή να αποβληθεί.                Η καρδιά του λιονταριού δεν θα έπαυε ποτέ να είναι ξένη. Ο παλμός της                θα μπορούσε ξαφνικά να στραφεί εναντίον του φορέα της, να σταματήσει,                να τον προδώσει χωρίς προειδοποίηση. Πώς ζει κανείς γνωρίζοντας ότι                κάθε ημέρα μπορεί να είναι η τελευταία; Πώς κοιμάται, πώς βαδίζει στη                μάχη; Ίσως εδώ να βρίσκεται το κλειδί για την ακατανόητη ανδρεία του                Ριχάρδου. Μετά την επέμβαση, οι μαρτυρίες μιλούν για έναν άνθρωπο                μεταμορφωμένο: η φυσική του αντοχή αυξήθηκε, το βλέμμα του έγινε                διαπεραστικό, η συμπεριφορά του σχεδόν προκλητική απέναντι στον                κίνδυνο. Δεν πολεμούσε απλώς με θάρρος· πολεμούσε σαν κάποιος που είχε                ήδη συμφιλιωθεί με τον θάνατο. Αν κάθε μάχη μπορούσε να είναι η                τελευταία του, γιατί να μην ριχτεί σε αυτήν με όλη του τη δύναμη;                Γιατί να μην προηγείται των στρατευμάτων, να εκτίθεται στα βέλη, να                προκαλεί τη μοίρα; Ο φόβος της απόρριψης του μοσχεύματος μετατράπηκε,                έτσι, σε κινητήρια δύναμη. Η αβεβαιότητα έγινε τόλμη.            </p><p>                    Οι μάχες που συμμετείχε πολλές και διαδοχικές. Πολλοί που τον                    συναντούσαν στη μάχη τρεπόντουσαν σε άτακτη φυγή. Όμως όση υπεράνθρωπη                    δύναμη κι αν του έδινε η νέα του καρδιά παρέμενε ένας. Αλλά αυτός ήταν                    και ο μόνος του περιορισμός ο οποίος φάνηκε με την αποτυχία κατάληψης                    της Ιερουσαλήμ. Μπορεί αυτός να τρεφόταν από τη μάχη αλλά ο στρατός                    του ήθελε επιμελητεία την οποία δεν είχε.                </p><p>                    Μετά την αποτυχημένη Τρίτη Σταυροφορία αιχμαλωτίστηκε (1192) κοντά στη                    Βιέννη από τον Λεοπόλδο Ε΄, που κατηγόρησε τον Ριχάρδο ότι είχε                    συμμετοχή στη δολοφονία του ξαδέλφου του, Κορράδου του Μομφερράτου. Ο                    πραγματικός λόγος όμως ήταν ότι θεωρούσε πως κλέβοντας τη                    μεταμοσχευμένη καρδιά του θα αποκτούσε αυτός υπεράνθρωπη ρώμη και θα                    γίνει πολεμικός επαΐων. Βέβαια αυτή τη σκέψη την είχαν κι άλλοι                    επιφανείς ηγέτες της περιόδου. Γι αυτό και μετά από ένα χρόνο, και                    καθώς δεν έβρισκε τρόπο πως θα γίνει επιτυχώς η εγχείρηση, ο Δούκας                    Λεοπόλδος αναγκάστηκε να τον παραδώσει στον αυτοκράτορα Ερρίκο ΣΤ’ της                    Αγίας Ρωμαϊκής Αυτοκρατορίας. Παρ’ αυτά ο τελευταίος, επίσης μη                    μπορώντας να βρεί πως θα κάνει ο ίδιος την επέμβαση, δέχεται τα                    150.000 μάρκα ασήμι για επιστρέψει ο Λεοπόλδος στην Αγγλία. Αυτό ήταν                    ένα δυσθεώρητο ποσό για την εποχή, αλλά υπήρχε ο φόβος μη τυχόν και                    μετά από μια επιτυχημένη επέμβαση καταστεί ο αυτοκράτορας ασταμάτητος.                </p><p>                    Επιστρέφοντας στην Αγγλία δεν έμεινε άπραγος. Ξεκίνησε κατευθείαν να                    σχεδιάζει την επόμενη Σταυροφορία. Όμως κατά τη διάρκεια μιας                    πολιορκίας κάστρου στη Γαλλία τα λόγια των αλχημιστών επαληθεύτηκαν.                    Τα «ιστορικά» στοιχεία βέβαια λένε ότι έπαθε γάγγραινα από ένα βέλος.                    Μετά δηλαδή από τόσες μάχες, αιχμαλωσίες κτλ κτλ «αρκούσε» απλά ένα                    βέλος να τον βγάλει εκτός μάχης σαν άλλο Αχιλλέα. Και γιατί του                    αφαίρεσαν και έκρυψαν τη καρδιά μετά; Προφανώς ήθελαν να κρύψουν τη                    καρδιά για μη χρησιμοποιηθεί από κανένα και να χαθεί η απόκρυφη γνώση                    στα βάθη της ιστορίας.                </p><p>                    Έτσι, ο Ριχάρδος ο Λεοντόκαρδος έμεινε στην ιστορία απλά ως άλλος ένας                    απλά θαρραλέος πολεμιστής, ενώ ήταν κάτι πολύ μεγαλύτερο. Ήταν ένα                    επιτυχημένο αλχημιστικό πείραμα που τρόμαξε τόσο πολύ όσους είδαν τα                    αποτελέσματά του, που προτιμήθηκε η γνώση αυτή να θαφτεί και να                    δαιμονοποιηθεί.                </p></>",
  },
    {
    id: 24,
    date: "9/2/2026",
    title: "Υπερθέρμανση του σύμπαντος",
    pic: "iperthermansi",
    category: "ΦΥΣΙΚΗ",
    author: "ROBERT MUGABE jr",
    link: "iperthermansi",
    text: " Lore22m ipsum",
  },  
    {
    id: 23,
    date: "8/2/2026",
    title: "Το Τάγμα των Ταγμάτων",
    pic: "illuminati",
    category: "ΙΣΤΟΡΙΑ",
    author: "Idi Amin Dada Oumee",
    link: "illuminati",
    text: " Lore22m ipsum",
  },   {
    id: 22,
    date: "8/2/2026",
    title: "Άχαστα σημεία της Κυριακής #4",
    pic: "axasta4",
    category: "ΣΤΟΙΧΗΜΑ",
    author: "SAFARI SNIPER",
    link: "axasta4",
    text: " Lore22m ipsum",
  },
{
    id: 21,
    date: "8/2/2026",
    title:
      "Ο θάνατος του Ιωάννη Β’ Κομνηνού: Επίθεση από αγριόχοιρο ή κάποιο παρεξηγημένο Pokemon;",
    pic: "pokemon",
    category: "ΙΣΤΟΡΙΑ",
    author: "Ζήνων, ο Ταρασικοδίσσας ",
    link: "pokemon",
    text: " Lorem ipsum",
  },
  {
    id: 20,
    date: "7/2/2026",
    title:
      "Ο Χαμένος Αρχαίος Θρύλος του Πιγκάλ — Το Ιερό Εργαλείο που Διαμόρφωσε τον Πολιτισμό.",
    pic: "pigal",
    category: "ΙΣΤΟΡΙΑ",
    author: "Father Diablo",
    link: "pigal",
    text: " Lorem ipsum",
  },
  {
    id: 19,
    date: "7/2/2026",
    title: "Απάντηση στους Άσχετους- Ανάλυση των επών του Πύθουλα #1",
    pic: "pith1",
    category: "ΠΟΛΙΤΙΣΜΟΣ",
    author: "ROBERT MUGABE jr",
    link: "pith1",
    text: " Lorem ipsum",
  },
  {
    id: 18,
    date: "6/2/2026",
    title: "Κινέζοι κατάσκοποι και στο ζωικό βασίλειο",
    pic: "lemourioi",
    category: "ΠΟΛΙΤΙΣΜΟΣ",
    author: "ROBERT MUGABE jr",
    link: "lemourioi",
    text: " Lore22m ipsum",
  },
  {
    id: 17,
    date: "6/2/2026",
    title: "Σπείρα της υποταγής συνειδήσεων: ο κύκλος θανάτου και κυτταρίνης",
    pic: "xarti",
    category: "ΤΕΧΝΟΛΟΓΙΑ",
    author: "ΑΓΑΘΟΚΛΗ",
    link: "xarti",
    text: " Lore22m ipsum",
  },
  {
    id: 16,
    date: "6/2/2026",
    title:
      "Εσφιγμένου: Η εκκλησιαστική σύγκρουση που διχάζει την Ορθοδοξία – Κατηγορίες, βία και μια πληγή 50 ετών",
    pic: "moni",
    category: "ΠΟΛΙΤΙΣΜΟΣ",
    author: "Father Diablo",
    link: "moni",
    text: " Lore22m ipsum",
  },
  {
    id: 15,
    date: "5/2/2026",
    title:
      "Artemis II: Το Παλαιό Σεληνιακό Συμβούλιο και η υποταγή του ανθρώπινου είδους",
    pic: "artemis",
    category: "ΦΥΣΙΚΗ",
    author: "ΑΓΑΘΟΚΛΗ",
    link: "artemis",
    text: " Lore22m ipsum",
  },
  {
    id: 14,
    date: "5/2/2026",
    title: "Άχαστα σημεία της Πέμπτης #3",
    pic: "axasta3",
    category: "ΣΤΟΙΧΗΜΑ",
    author: "SAFARI SNIPER",
    link: "axasta3",
    text: " Lore22m ipsum",
  },
  {
    id: 13,
    date: "5/2/2026",
    title:
      "Οι Σκιώδεις Αρχιτέκτονες του Χάους: Πώς οι Τραπεζίτες και οι Ελίτ Σκηνοθέτησαν τον Πρώτο Παγκόσμιο Πόλεμο",
    pic: "ww1",
    category: "ΙΣΤΟΡΙΑ",
    author: "Idi Amin Dada Oumee",
    link: "ww1",
    text: " Lore22m ipsum",
  },
  {
    id: 12,
    date: "4/2/2026",
    title: "Το Κολυμβάρι, ο Οικουμενισμός και η κρίση στην σύγχρονη Ορθοδοξία",
    pic: "cigar",
    category: "ΠΟΛΙΤΙΣΜΟΣ",
    author: "Father Diablo",
    link: "cigar",
    text: " Lore22m ipsum",
  },
  {
    id: 11,
    date: "4/2/2026",
    title: "Άχαστα σημεία της Τετάρτης #2",
    pic: "arubi",
    category: "ΣΤΟΙΧΗΜΑ",
    author: "SAFARI SNIPER",
    link: "arubi",
    text: " Lore22m ipsum",
  },
  {
    id: 10,
    date: "4/2/2026",
    title: "Νέα Τάξη πραγμάτων και οικογενειακή δυστυχία",
    pic: "diazigia",
    category: "ΟΙΚΟΝΟΜΙΑ",
    author: "ROBERT MUGABE jr",
    link: "diazigia",
    text: " Lore22m ipsum",
  },
  {
    id: 9,
    date: "3/2/2026",
    title: "O Σμαραγδιζων Σιδηρούν Ήλιος",
    pic: "ilios",
    category: "ΦΥΣΙΚΗ",
    author: "ROBERT MUGABE jr",
    link: "ilios",
    text: " Lore22m ipsum",
  },
  {
    id: 8,
    date: "3/2/2026",
    title: 'Ήταν Εβραίος ο "Μέγας" Κωνσταντίνος?',
    pic: "konnos",
    category: "ΙΣΤΟΡΙΑ",
    author: "ROBERT MUGABE jr",
    link: "konnos",
    text: " Lore22m ipsum",
  },
  {
    id: 7,
    date: "3/2/2026",
    title: '"Ελλειπείς" ελλείψεις και "τέλειοι" κύκλοι',
    pic: "ellipseis",
    category: "ΦΥΣΙΚΗ",
    author: "ROBERT MUGABE jr",
    link: "ellipseis",
    text: " Lore22m ipsum",
  },
  {
    id: 6,
    date: "3/2/2026",
    title: "Ιστορική καταγωγή των πάντων (και του T-Rex)",
    pic: "dinosaur",
    category: "ΦΥΣΙΚΗ",
    author: "ROBERT MUGABE jr",
    link: "dinosaur",
    text: " Lore22m ipsum",
  },
  {
    id: 5,
    date: "1/2/2026",
    title: "Μας τα λεγε ο Μελ απ' το 2002!!!",
    pic: "faraday",
    category: "ΦΥΣΙΚΗ",
    author: "ROBERT MUGABE jr",
    link: "faraday",
    text: " Lore22m ipsum",
  },
  {
    id: 4,
    date: "1/2/2026",
    title: "Άχαστα σημεία της Κυριακής #1",
    pic: "axasta",
    category: "ΣΤΟΙΧΗΜΑ",
    author: "SAFARI SNIPER",
    link: "axasta",
    text: " Lore22m ipsum",
  },
  {
    id: 3,
    date: "1/2/2026",
    title: "Γενετικά πειράματα στη Μινωική Κρήτη???",
    pic: "genetika",
    category: "ΙΣΤΟΡΙΑ",
    author: "ROBERT MUGABE jr",
    link: "genetika",
    text: " Lore22m ipsum",
  },
  {
    id: 2,
    date: "1/2/2026",
    title: "Δυτική μουσική-Από τον Μπαχ στον Πύθουλα",
    pic: "mousiki",
    category: "ΙΣ22ΤΟΡΙΑ",
    author: "ROBERT MUGABE jr",
    link: "mousiki",
    text: " Lore22m ipsum",
  },
  {
    id: 1,
    date: "1/2/2026",
    title: "Αφρική το νέο Ελντοράντο;",
    pic: "eldorado",
    category: "ΣΤΟΙΧΗΜΑ",
    author: "SAFARI SNIPER",
    link: "eldorado",
    text: " Lore22m ipsum",
  },
];

function combineTexts(articles) {
  let result = "";

  articles.forEach((article) => {
   result +=
      '<div class="newscontainer"><div><div class="newsdiv"><a href="temp/template1.html?text=' +
      encodeURIComponent(article.id) +
      '"><img src="/thanasimiora/resources/images/' +
      article.pic +
      '.png" alt="article"/></a><h6 class="category"> ' +
      article.category +
      '</h6></div><h5 id="date">' +
      article.date +
      '</h5></div><a href="temp/template1.html?text=' +
      encodeURIComponent(article.id) +
      '"><h1 id="title">' +
      article.title +
      "</h1></a></div>";
  });
  return result.trim();
}

const newz = combineTexts(articles);

const newsEl = document.getElementById("news");
if (newsEl) {
  newsEl.innerHTML = newz;
}

document.addEventListener("click", function (e) {
  if (e.target.classList.contains("dropdown-item")) {
    e.preventDefault();

    const cat = e.target.dataset.category;
    filterArticles(cat);
  }
});

function filterArticles(cat) {
  let result = "";

  articles.forEach((article) => {
    if (article.category == cat) {
    result +=
      '<div class="newscontainer"><div><div class="newsdiv"><a href="temp/template1.html?text=' +
      encodeURIComponent(article.id) +
      '"><img src="/thanasimiora/resources/images/' +
      article.pic +
      '.png" alt="article"/></a><h6 class="category"> ' +
      article.category +
      '</h6></div><h5 id="date">' +
      article.date +
      '</h5></div><a href="temp/template1.html?text=' +
      encodeURIComponent(article.id) +
      '"><h1 id="title">' +
      article.title +
      "</h1></a></div>";
    }

    
    if (newsEl) {
      newsEl.innerHTML = result;
    } else {
      const newstemplate1 =
        document.getElementByclassname("template1container")[0];
      newstemplate1.innerHTML = result;
    }
  });
}

document.getElementById("barr").innerHTML =
  '<div><button id="menu" data-bs-toggle="dropdown">☰</button><ul id="menu"class="dropdown-menu"><li><a class="dropdown-item"  href="#" data-category=ΙΣΤΟΡΙΑ>ΙΣΤΟΡΙΑ</a></li><li><a class="dropdown-item"   href="#" data-category=ΦΥΣΙΚΗ>ΦΥΣΙΚΗ</a></li><li><a class="dropdown-item"   href="#" data-category=ΠΟΛΙΤΙΣΜΟΣ>ΠΟΛΙΤΙΣΜΟΣ</a></li><li><a class="dropdown-item"  href="#" data-category=ΤΕΧΝΟΛΟΓΙΑ>ΤΕΧΝΟΛΟΓΙΑ</a></li><li><a class="dropdown-item"   href="#" data-category=ΟΙΚΟΝΟΜΙΑ>ΟΙΚΟΝΟΜΙΑ</a></li><li><a class="dropdown-item"  href="#" data-category=ΣΤΟΙΧΗΜΑ>ΣΤΟΙΧΗΜΑ</a></li></ul></div><div id=logo><a href="/thanasimiora/index.html"><img id=logo src="/thanasimiora/resources/images/logo.png" alt="logo" width="100%" height="50%"></a></div><div><ul class="sec_colornav col-md-4 justify-content-end list-unstyled d-flex" ><li  class="ms-3"><a class="text-body-secondary" href="#"><svg id="social" xmlns="http://www.w3.org/2000/svg" width="16" height="16" fill="currentColor" class=" text1 bi bi-twitter-x " viewBox="0 0 16 16"><path d="M12.6.75h2.454l-5.36 6.142L16 15.25h-4.937l-3.867-5.07-4.425 5.07H.316l5.733-6.57L0 .75h5.063l3.495 4.633L12.601.75Zm-.86 13.028h1.36L4.323 2.145H2.865z"/></svg></a></li><li class="ms-3"><a class="text-body-secondary" href="#"><svg  id="social" xmlns="http://www.w3.org/2000/svg" width="16" height="16" fill="currentColor" class=" text1 bi bi-instagram" viewBox="0 0 16 16"><path d="M8 0C5.829 0 5.556.01 4.703.048 3.85.088 3.269.222 2.76.42a3.9 3.9 0 0 0-1.417.923A3.9 3.9 0 0 0 .42 2.76C.222 3.268.087 3.85.048 4.7.01 5.555 0 5.827 0 8.001c0 2.172.01 2.444.048 3.297.04.852.174 1.433.372 1.942.205.526.478.972.923 1.417.444.445.89.719 1.416.923.51.198 1.09.333 1.942.372C5.555 15.99 5.827 16 8 16s2.444-.01 3.298-.048c.851-.04 1.434-.174 1.943-.372a3.9 3.9 0 0 0 1.416-.923c.445-.445.718-.891.923-1.417.197-.509.332-1.09.372-1.942C15.99 10.445 16 10.173 16 8s-.01-2.445-.048-3.299c-.04-.851-.175-1.433-.372-1.941a3.9 3.9 0 0 0-.923-1.417A3.9 3.9 0 0 0 13.24.42c-.51-.198-1.092-.333-1.943-.372C10.443.01 10.172 0 7.998 0zm-.717 1.442h.718c2.136 0 2.389.007 3.232.046.78.035 1.204.166 1.486.275.373.145.64.319.92.599s.453.546.598.92c.11.281.24.705.275 1.485.039.843.047 1.096.047 3.231s-.008 2.389-.047 3.232c-.035.78-.166 1.203-.275 1.485a2.5 2.5 0 0 1-.599.919c-.28.28-.546.453-.92.598-.28.11-.704.24-1.485.276-.843.038-1.096.047-3.232.047s-2.39-.009-3.233-.047c-.78-.036-1.203-.166-1.485-.276a2.5 2.5 0 0 1-.92-.598 2.5 2.5 0 0 1-.6-.92c-.109-.281-.24-.705-.275-1.485-.038-.843-.046-1.096-.046-3.233s.008-2.388.046-3.231c.036-.78.166-1.204.276-1.486.145-.373.319-.64.599-.92s.546-.453.92-.598c.282-.11.705-.24 1.485-.276.738-.034 1.024-.044 2.515-.045zm4.988 1.328a.96.96 0 1 0 0 1.92.96.96 0 0 0 0-1.92m-4.27 1.122a4.109 4.109 0 1 0 0 8.217 4.109 4.109 0 0 0 0-8.217m0 1.441a2.667 2.667 0 1 1 0 5.334 2.667 2.667 0 0 1 0-5.334"/></svg></a></li><li class="ms-3"><a class="text-body-secondary" href="#"><svg  id="social" xmlns="http://www.w3.org/2000/svg" width="16" height="16" fill="currentColor" class=" text1 bi bi-facebook" viewBox="0 0 16 16"><path d="M16 8.049c0-4.446-3.582-8.05-8-8.05C3.58 0-.002 3.603-.002 8.05c0 4.017 2.926 7.347 6.75 7.951v-5.625h-2.03V8.05H6.75V6.275c0-2.017 1.195-3.131 3.022-3.131.876 0 1.791.157 1.791.157v1.98h-1.009c-.993 0-1.303.621-1.303 1.258v1.51h2.218l-.354 2.326H9.25V16c3.824-.604 6.75-3.934 6.75-7.951"/></svg></use></svg></a></li></ul></div>';

document.getElementById("crypto_container").innerHTML =
  '<div class="crypto"><gecko-coin-price-static-headline-widget locale="en"    outlined="false" coin-ids="popcat,simon-s-cat, poocoin,pepe,floki,dogecoin,hamster-kombat,shiba-inu,pepe-trump"  initial-currency="usd"></gecko-coin-price-static-headline-widget>  </div> <div aria-hidden class="crypto"> <gecko-coin-price-static-headline-widget  locale="en"  outlined="false"  coin-ids="popcat,poocoin,pepe,floki,dogecoin,hamster-kombat,shiba-inu,pepe-trump"  initial-currency="usd" ></gecko-coin-price-static-headline-widget>  </div>';

document.getElementById("footer").innerHTML =
  '<div class="footer-children col-md-4 d-flex align-items-center">  <a id="footer-text" href="/thanasimiora/oroi.html">Όροι Χρήσης</a>  <img    src="/thanasimiora/resources/images/logo_footer.png"    alt="logo"    width="100%"    height="100px"  /><a id="footer-text" href="/thanasimiora/epikoinwnia.html">Επικοινωνία</a></div>';

document.getElementById("comments-section").innerHTML =
  '<h3>Σχόλια</h3>      <div id="comments-list" class="comments-list"></div>      <h4>Γράψτε ένα σχόλιο...</h4>      <input        type="text"        id="comment-name"        placeholder="Όνομα (Προαιρετικά)"        class="comment-input"      />      <textarea        id="comment-text"        placeholder="Σχόλιο"        class="comment-textarea"      ></textarea>      <button onclick="postComment()" class="comment-button">Δημοσίευση</button>   ';

const script = document.createElement("script");
script.src = "/thanasimiora/resources/javascript/comments.js";        // or inline script
script.defer = true;              // optional but recommended
document.body.appendChild(script);



function articlepage() {
  const params = new URLSearchParams(window.location.search);
  var v = articles.length - params.get("text");

  rr =
    '<img        class="template1div"        src="..\resources\images\'' +
    articles[v].pic +
    '.png"        alt="article"      />      <div class="subtext">        <h6>' +
    articles[v].category +
    "</h6>        <h5>" +
    articles[v].date +
    '</h5>      </div>      <h1 class="template1div">' +
    articles[v].title +
    '</h1>      <div class="article template1div">        <p>Από τον <b>' +
    articles[v].author +
    "</b></p>        " +
    articles[v].text +
    "      </div>    </div>";

  document.getElementById("testing").innerHTML = rr;
}

































